- Aulas F088 a F091

___

In [3]:
import pandas as pd
import sqlalchemy

### Engine de Conexão ao Banco de Dados MySQL

Sintaxe: _engine=sqlalchemy.create_engine('mysql+drive://usuario:senha@ip-servidor:porta/banco-de-dados')_

**Criando a conexão:**

In [8]:
# Esses parâmetros não existe. Irei fazer apenas exemplos
engine=sqlalchemy.create_engine('mysql+pymysql://noctuaa:123456@localhost:3306/employees')

___

# Método: read_sql_table

**Parametros do método:**
- table_name = Nome da tabela onde será feita a leitura dos dados;
- con = Objeto conexão criado pelo SQLAlchemy (é a variável da conexão que foi criada);
- schema = Schema (base de dados) onde a tabela está armazenada;
- index_col = Coluna a ser definida como index;
- ...

**Lendo toda a tabela Employees e transformando em DataFrame**

In [10]:
df = pd.read_sql_table('employees', engine)

**Listando os dados e informações dos atributos**

In [11]:
df.head()

   emp_no birth_date first_name last_name gender department  left   hire_date
0   10001 1953-09-02     Georgi   Facello      M      sales     1  2018-01-17
1   10002 1964-06-02    Bezalel    Simmel      F      sales     1  2015-02-02
2   10003 1959-12-03      Parto   Bamford      M      sales     1  2017-01-22
3   10004 1954-05-01  Chirstian   Koblick      M      sales     1  2016-01-28
4   10005 1955-01-21    Kyoichi  Maliniak      M      sales     1  2018-01-17

In [13]:
# Podemos perceber que se tornou um DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14999 entries, 0 to 14998
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      14999 non-null  int64
 1   birth_date  14999 non-null  datetime64[ns]
 2   first_name  14999 non-null  object
 3   last_name   14999 non-null  object
 4   gender      14999 non-null  object
 5   department  14999 non-null  object
 6   left        14999 non-null  int64
 7   hire_date   14999 non-null  object
dtypes: datetime64[ns](1), int64(2), object(5)
memory usage: 937.6+ KB

___

# Método: read_sql_query

**Parametros do método:**

- sql = String SQL Query que deverá ser executada para retornar o conjunto de dados.
- con = Objeto conexão criado pelo SQLAlchemy.
- index_col = Coluna a ser definida como index.
- params = Lista de parametros para serem passados ao método.

**Criando um DataFrame apartir de uma query ao banco de dados.**

In [14]:
df = pd.read_sql_query('SELECT * FROM employees', engine)

In [15]:
df.head()

   emp_no birth_date first_name last_name gender department  left   hire_date
0   10001 1953-09-02     Georgi   Facello      M      sales     1  2018-01-17
1   10002 1964-06-02    Bezalel    Simmel      F      sales     1  2015-02-02
2   10003 1959-12-03      Parto   Bamford      M      sales     1  2017-01-22
3   10004 1954-05-01  Chirstian   Koblick      M      sales     1  2016-01-28
4   10005 1955-01-21    Kyoichi  Maliniak      M      sales     1  2018-01-17

**Criando um DataFrame apartir de uma query ao banco de dados utilizando a coluna emp_no como _index_**

In [16]:
df_index = pd.read_sql_query('SELECT * FROM employees', engine, index_col='emp_no')

In [17]:
df_index.head()

       birth_date first_name last_name gender department  left   hire_date
emp_no
10001  1953-09-02     Georgi   Facello      M      sales     1  2018-01-17
10002  1964-06-02    Bezalel    Simmel      F      sales     1  2015-02-02
10003  1959-12-03      Parto   Bamford      M      sales     1  2017-01-22
10004  1954-05-01  Chirstian   Koblick      M      sales     1  2016-01-28
10005  1955-01-21    Kyoichi  Maliniak      M      sales     1  2018-01-17

**Criando um DataFrame apartir de uma query ligando várias tabelas**

In [20]:
query = ''' 
SELECT
    emp.first_name,
    emp.last_name,
    emp.gender,
    depar.dept_name as departament_name,
    dept.from_date,
    dept.to_date
FROM employees emp
INNER JOIN dept_emp dept
ON emp.emp_no = dept.emp_no
    INNER JOIN departments depar
    ON dept.dept_no = depar.dept_no;
'''

In [ ]:
df2 = pd.read_sql_query(query, engine)

In [ ]:
df2.head()

**Criando um DataFrame apartir de uma query utilizando parametros dinâmicos**

In [34]:
query = 'SELECT first_name, last_name FROM employees WHERE first_name = %S'

In [ ]:
df3 = pd.read_sql_query(query, engine, params=['Mary'])

___

# Método: read_sql

Faz o roteamento entre os métodos read_table e read_sql_query.

**Parametros do método**:
- sql = String SQL Query que deverá ser executada para retornar o conjunto de dados;
- con = Objeto conexão criado pelo SQLAlchemy;
- index_col = Coluna a ser definida como index.
- params = Lisa de parametros para serem passados ao método

**Criando o DataFrame passando apenas o nome da tabela para o método**

In [43]:
df4 = pd.read_sql('employees', engine)

In [44]:
df4.head()

   emp_no birth_date first_name last_name gender department  left   hire_date
0   10001 1953-09-02     Georgi   Facello      M      sales     1  2018-01-17
1   10002 1964-06-02    Bezalel    Simmel      F      sales     1  2015-02-02
2   10003 1959-12-03      Parto   Bamford      M      sales     1  2017-01-22
3   10004 1954-05-01  Chirstian   Koblick      M      sales     1  2016-01-28
4   10005 1955-01-21    Kyoichi  Maliniak      M      sales     1  2018-01-17

___

# Método: to_sql

Escreve o DataFrame para o banco de dados relacional.

**Criando a base de dados e criando o DataFrame**.

In [50]:
df = pd.read_csv('datasets/Automobile_data.csv', usecols=['symboling', 'normalized-losses', 'make', 'fuel-type', 'aspiration'])

In [51]:
df.head()

   symboling normalized-losses         make fuel-type aspiration
0          3                 ?  alfa-romero       gas        std
1          3                 ?  alfa-romero       gas        std
2          1                 ?  alfa-romero       gas        std
3          2               164         audi       gas        std
4          2               164         audi       gas        std

**Parametros do método:**
- name = Nome da tabela que será criada no SGBD
- con = Objeto conexão criado pelo SQLAlchemy
- schema = Nome do Schema (base de dados) onde será criada a tabela
- if_exists = Comportamento caso a tabela exista no SGBD
- index = Escreve o índice do DataFrame como uma coluna da tabela
- index_label = Nome da coluna de índice

**Criando a tabela no Banco de Dados a partir do DataFrame**.

In [53]:
df.to_sql(
    name = 'tb_automobile', 
    con = engine,
    if_exists = 'replace'
)

205